[
    {
        "title": "Comparison between Cryptocurrency and Dollar",
        "author": {
            "name": "ijeoma",
            "avatar": "https://secure.gravatar.com/avatar/2b63dd52f52192b9b84290f3e2ecc51c?s=80&d=identicon&r=g"
        },
        "content": "<div class=\"entry-content\"><p> Last time,we opened a bit on what cryptocurrency is, as well as Bitcoin and its advent.Well, today, we will be comparing Bitcoin to the United States Dollar. &nbsp; </p></div><p> First,we understand cryptocurrency to be,put quite simply, a digital currency;while the US dollar is an official currency backed by the government,as are other government - backed national currencies.We are going to attempt to address the differences between both currencies.</p> <p> 1. In link to <strong> what is a cryptocurrency </strong>, we discussed how cryptocurrency is decentralized (it is not owned or regulated by any known or centralized authority). Well, when it comes to the US dollar, the difference is quite clear. The dollar is owned and regulated by the United States government.&nbsp;</p> <p> 2. Another obvious dissimilarity between the two currency forms would be tangibility.While you can hold on to the touch, and feel it, if for any reason you find yourself holding onto any cryptocurrency,you’ ve been had!Cryptocurrency is only digital,while the fiat is both digital and tangible. </p><p> 3. Again,the various cryptocurrencies have a limit to the amount that could be in existence,while the dollar has an unlimited supply which means the central authority has no cap to the extent to which they can produce money. </p><p> 4. Since we have clarified and emphasized the digitality of cryptocurrency,it goes without saying that the method of storage would be digital as well.Making use of digital wallets(cryptocurrency wallets).This is not so with the dollar,which leans on the existence of banks and the Central Bank. </p><p> 5. Also,transactions using the fiat currency(dollar) can be reversed or charged back.This is seldom so when it comes to cryptocurrency. </p> <p> In our current clime and time,though,both serve as a means of exchange and a store of value,whilst relying on widespread consumer use for proper functionality.This is the most common similarity between the two currencies. &nbsp; </p><p> We have come to the end of this week’ s edition.Stay tuned or our next blog post coming up next week, it promises to be very informative.To get more information about thenewboston coin, click <a href = \"https://www.youtube.com/watch?v=D-3i1g5YFik\" > here </a> or follow us on <a href=\"https://www.facebook.com/TheNewBoston-464114846956315/\">Facebook</a>,<a href=\"https://www.linkedin.com/company/thenewboston-developers/\">LinkedIn</a>, <a href=\"https://twitter.com/bucky_roberts\">Twitter</a>, <a href=\"https://www.reddit.com/r/thenewboston/\">Reddit</a>, <a href=\"https://www.youtube.com/user/thenewboston\">YouTube</a>. You can also join the newBoston community <a href=\"https://join.slack.com/t/thenewboston/shared_invite/zt-kjaspi4k-ah6GEJUabA31Hn4DAeng5w\">here</a> to pitch a project or contribute to existing projects.</p> </div>",
        "datePosted":"February 17, 2021",
        "readTime": "6 min read"
    },
    {
        "title": "Cryptocurrency 101: Summary of the history and uses of cryptocurrency.",
        "author": {
            "name": "chibuzor",
            "avatar": "https://secure.gravatar.com/avatar/b63a7613761e31f2258b3a2f361933ba?s=100&r=pg&d=mm"
        },
        "content": "<div class=\"entry-content\"><p>Generally, when the question: “what exactly is a cryptocurrency” comes up, it is easy to reply; “Digital Currency”. Well, yes, but no. Let’s start at the top.&nbsp;Basically, cryptocurrency is the usage of digital files as money/currency. The name is coined from two terms:</p><p><strong>Cryptography: </strong>The science of hiding information</p><p><strong>Currency: </strong>Accepted system of money.</p><p>Think you can properly define what a cryptocurrency actually is now? Exactly, “Digital Currency” is easier.</p> <p>The idea of a cryptocurrency first came up in 1980, based on making anonymous transactions that would not require centralized authorities like Banks. Building on this notion, the first cryptographic electronic currency was developed, called <strong><em>Digicash,</em></strong> by David Chaum, an American cryptographer, in 1995. In 1998, another e-currency called Bit Gold was designed by Nick Szabo.</p> <p>While the Digicash required specific software and encrypted keys before transactions could be made, the Bit Gold required it’s users to gain by dedicating digital power to solving cryptographic puzzles. Combining these two ideas, the basic concept of the first usable cryptocurrency; <strong>Bitcoin,</strong> was born. Although, this would not be untll a decade later.</p> <p>Due to the fact that neither Chaum nor Szabo could solve the authenticity issue of their cryptocurrency, progress in this field was stunted until a white paper titled <em>Bitcoin – A Peer to Peer Electronic Cash System</em>, was published by a person or group of persons under the pseudonym Satoshi Nakamoto, on 31<sup>st</sup> October, 2008. This heavily described the functionality of a workable cryptocurrency based on the usage of it’s Blockchain Technology. It is worth noting that neither Bitcoin nor any other subsequent cryptocurrency would be possible without the advent of the Blockchain Technology, but this is a topic for another day.</p>      <p>With Bitcoin truly underway and functional, other cryptocurrencies were being developed and launched, such as <strong>Litecoin </strong>and <strong>Namecoin</strong> in 2011, <strong>Peercoin </strong>in 2012 <strong>, Dogecoin, Primecoin, Ripple </strong>and <strong>NXT </strong>in 2013. Within the decade, a host of other digital currencies came into light with varying degrees of success. There are currently over <strong>2000</strong> Cryptocurrencies in existence.&nbsp;</p>  <p>Cryptocurrency, given it’s development and implementation, has to have a lot of <em>benefits </em>to go with the amount of work put into its development.</p>   <p>One of the most important benefits of Cryptocurrency would be Low-Cost Transaction Rates. For instance, a particularly recent $99 Million Litecoin transaction was made and concluded in just under 3 minutes, and cost the initiator of the transaction a whopping $0.40, yes, you read that right. <strong>40 cents! </strong>This makes cryptocurrency the go-to currency for international transactions.</p> <p>Another benefit would be <strong>Private Transactions.</strong> The idea of explaining why you’re spending a particular sum of your own money to the bank is irksome. Essentially, your transactions do not go through long bureaucratic processes, which makes for even swifter transactions.</p><p>The last benefit we would be discussing is <strong>Total Ownership of your Funds. </strong>Given the development and ‘decentralization’ concept of cryptocurrency, no central entity or authority could place a censor or freeze your financial assets. Since most of the time, all it takes for one’s accounts to be frozen are barely proven accusations, usage of cryptocurrency like Bitcoin, provides censor-resistant alternatives.</p></div> ",
        "datePosted": "February 1, 2021",
        "readTime": "6 min read"
    }
]